<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"257fa09a53eaa139f9cdf517655824c305a64d23012406e745c528a6b656a1c8","plan_job_ref":"Job Plan Airflow DAGs #341 at https://github.com/cal-itp/data-infra/actions/runs/16358670328","plan_out_hash":"50cd9f2c7f7dd50e3ec503e64ff65547183a3c12125447bc0629c4e6fbd4d3fe","plan_hash":"b41bde9568c455ad4bd4f755b0c3bb18f98f6eb2b271a516ff26e1e405411133","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "I4/vjA==" -> (known after apply)
!~      detect_md5hash      = "0aJFZAPVdTvOYOXhpWG4Mw==" -> "different hash"
!~      generation          = 1752704802135806 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "0aJFZAPVdTvOYOXhpWG4Mw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["seeds/payments_entity_mapping.csv"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "ADTWuA==" -> (known after apply)
!~      detect_md5hash      = "bEGR2bSCFDvRHqw53kx19A==" -> "different hash"
!~      generation          = 1751416664118695 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/seeds/payments_entity_mapping.csv"
!~      md5hash             = "bEGR2bSCFDvRHqw53kx19A==" -> (known after apply)
        name                = "data/warehouse/seeds/payments_entity_mapping.csv"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "dVHj5Q==" -> (known after apply)
!~      detect_md5hash      = "hU3oewdQ19XGteAtTPhkEg==" -> "different hash"
!~      generation          = 1752704803461956 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "hU3oewdQ19XGteAtTPhkEg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "TRME7g==" -> (known after apply)
!~      detect_md5hash      = "Bbg+XMtcTYobWQu5IsmAHg==" -> "different hash"
!~      generation          = 1752704803221813 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "Bbg+XMtcTYobWQu5IsmAHg==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #341](https://github.com/cal-itp/data-infra/actions/runs/16358670328)